# IsEmpty Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Outline..::..IsEmpty Property
Outline Class See Also
---
Identifies if the outline represents an empty outline.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool IsEmpty { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsEmpty As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsEmpty {
	bool get ();
}
```

# See Also
Outline Class
Autodesk.Revit.DB Namespace